
&НаСервере

Функция ПолучитьРасшифровкуНаСервере(Расшифровка, МассивИменРасшифровки, ЭтоГруппа = Ложь)
	//Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	//Поля = Данные.Элементы.Получить(Расшифровка).ПолучитьПоля();
	//Для Каждого ИмяРасшифровки Из МассивИменРасшифровки Цикл
	//	ПолеДокумент = Поля.Найти(ИмяРасшифровки);
	//	Если Не ПолеДокумент = Неопределено
	//		Тогда Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	//Возврат ПолеДокумент.Значение;
КонецФункции


&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
//	МассивДляРасшифровки = Новый Массив();
//	МассивДляРасшифровки.Добавить("Регистратор");
//	//МассивДляРасшифровки.Добавить("Номенклатура");
//	
//	РасшифрЗначение = ПолучитьРасшифровкуНаСервере(Расшифровка, МассивДляРасшифровки);
//	Если РасшифрЗначение = Неопределено
//		Тогда Возврат;
//	КонецЕсли;
//	//**************************
//	СтандартнаяОбработка = Ложь;
//	//*************************
//	ОбработРасшифр = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки,Новый ИсточникДоступныхНастроекКомпоновкиДанных(Отчет));
//	
//	ВыпДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Расшифровать;
//	ПараметрВыполненногоДействия = Неопределено;
//	ДоступныеДействия = Новый Массив;
//	
//	ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
//	НашиПункты = Новый СписокЗначений;
////	ОбщСтрока = "Открыть обороты партий товаров по " + РасшифрЗначение;
//	НашиПункты.Добавить( 1, "Открыть документ ");
////	НашиПункты.Добавить( 6, ОбщСтрока + " за шесть месяцев.");
//	//***************************************
//	ОбработРасшифр.ВыбратьДействие(Расшифровка, ВыпДействие, ПараметрВыполненногоДействия, ДоступныеДействия, НашиПункты);
//	
//	Если ВыпДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Нет Тогда
//	ИначеЕсли ВыпДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
//		ОткрытьЗначение(ПараметрВыполненногоДействия);
//	//ИначеЕсли ТипЗнч(ВыпДействие) = Тип("Число") Тогда
//	//	
//	//	Парам = новый Структура();
//	//	Парам.Вставить("Нач",ДобавитьМесяц(ТекущаяДата(),-ВыпДействие));
//	//	Парам.Вставить("Кон",ТекущаяДата());
//	//	
//	//	Парам.Вставить("СформироватьПриОткрытии",истина);
//	//	Парам.Вставить("Номенклатура",РасшифрЗначение);
//	//	ОткрытьФорму("Отчет.ПартииТоваров.Форма.ФормаОтчета",Новый Структура("Параметры",Парам));
//	КонецЕсли;
КонецПроцедуры



//Функция ПроверитьСуществованиеКаталога(ИмяКаталога)Экспорт
//    КаталогНаДиске = Новый Файл(ИмяКаталога);
//    Если КаталогНаДиске.Существует() Тогда
//        Возврат Истина;
//	Иначе
//	//    Ответ = Вопрос("Каталог не существует. Создать?", 
//	//                    РежимДиалогаВопрос.ОКОтмена);
//	//    Если Ответ = КодВозвратаДиалога.ОК Тогда
//	//        СоздатьКаталог(ИмяКаталога);
//	//        Возврат Истина;
//	//    Иначе
//	        Возврат Ложь;
//	//    КонецЕсли;
//    КонецЕсли;
//КонецФункции

//&НаКлиенте
//Процедура ПриОткрытии(Отказ)
//	//ПриОткрытииНаСервере(Отказ);
//	РезОтчета=СформироватьОтчетНаСервере();
//	
//	//РезОтчета = ПолучитьИзВременногоХранилища(АдресХранилища);
//	
//	Для Каждого Элемент из РезОтчета Цикл 
//		//Для Каждого Элемент1 из масиив Цикл 
//		//	Сообщить(Элемент.Организация);
//			ИмяОрганизации=Элемент.Организация;//РезОтчета.ИмяОрганизации;
//			ТабДокумент=Элемент.ТаблДокум;
//			ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
//			ТабДокумент.АвтоМасштаб =Истина;

//			Если ПроверитьСуществованиеКаталога(КаталогДокументов()+"\ОтчетыНМУ") = ложь Тогда
//				СоздатьКаталог(КаталогДокументов()+"\ОтчетыНМУ");
//			КонецЕсли;
//			
//			ПолноеИмяФайлаXLS =КаталогДокументов()+"\ОтчетыНМУ\"+СокрЛП("АС_50_62_"+ИмяОрганизации)+".xls";
//			ПолноеИмяФайлаPDF =КаталогДокументов()+"\ОтчетыНМУ\"+СокрЛП("АС_50_62_"+ИмяОрганизации)+".PDF";
//			
//			Попытка
//				ТабДокумент.Записать(ПолноеИмяФайлаXLS, ТипФайлаТабличногоДокумента.XLS97);
//				ТабДокумент.Записать(ПолноеИмяФайлаPDF, ТипФайлаТабличногоДокумента.PDF);
//				Сообщить("Файл отчета успешно сформирован. Путь к файлу: "+ПолноеИмяФайлаXLS);
//			Исключение
//			КонецПопытки;
//			//Прервать;
//		//КонецЦикла;
//	КонецЦикла;

//	// Чтобы не писалось "Отчет не сформирован..."
//	Элементы.Результат.ОтображениеСостояния.Видимость = Ложь;
//	Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
//	ЭтотОбъект.ПодключитьОбработчикОжидания("ПослеФормированияОтчета",5,Истина);
//	
//КонецПроцедуры

//&НаСервере
//Функция СформироватьОтчетНаСервере()
//	Выборка= Справочники.Организации.Выбрать();
//	ОбъектОтчет = РеквизитФормыВЗначение("Отчет");
//	
//	ОСКД = ОбъектОтчет.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
//	НастройкиОСКД = ОСКД.НастройкиПоУмолчанию;
//	// таблицу значение передавать с сервера на клиент запрещено почемуто . поэтому передаем массив со структурой
//	//ТаблЗначений=Новый ТаблицаЗначений;
//	//ТаблЗначений.Колонки.Добавить("ИмяОрганизации");
//	//ТаблЗначений.Колонки.Добавить("ТаблДокумент");
//		
//    МассивЗнач=Новый Массив;

//	Пока Выборка.Следующий() Цикл
//		Если Выборка.Ссылка.ПометкаУдаления Тогда
//			Продолжить;
//		КонецЕсли; 
//		
//		ТаблДокум=Новый ТабличныйДокумент;
//		//НастройкиОСКД = КомпоновщикНастроек.ПолучитьНастройкиОСКД();
//		
//		ПараметрыДанныхОСКД = НастройкиОСКД.ПараметрыДанных.Элементы;
//		
//		//ЭлементНачалоПериода = ПараметрыДанныхОСКД.Найти("НачалоПериода");
//		//ЭлементНачалоПериода.Использование = Истина;
//		//ЭлементНачалоПериода.Значение = НачалоМесяца(ТекущаяДата());
//		//
//		//ЭлементКонецПериода = ПараметрыДанныхОСКД.Найти("КонецПериода");
//		//ЭлементКонецПериода.Использование = Истина;
//		//ЭлементКонецПериода.Значение = КонецМесяца(ТекущаяДата());
//		
//		ЭлементОрганизация = ПараметрыДанныхОСКД.Найти("Организация");
//		ЭлементОрганизация.Использование = Истина;
//		ЭлементОрганизация.Значение = Выборка.Ссылка;//Справочники.Организации.НайтиПоКоду("00-000001");
//		
//		//КомпоновщикНастроекДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
//		//КомпоновщикНастроекДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ОСКД));
//		//КомпоновщикНастроекДанных.ЗагрузитьНастройкиОСКД(ОСКД.НастройкиОСКДПоУмолчанию);
//		//КомпоновщикНастроекДанных.ЗагрузитьПользовательскиеНастройкиОСКД(Отчет.КомпоновщикНастроек.ПользовательскиеНастройкиОСКД);
//		
//		КомпоновщикМакетаОСКД = Новый КомпоновщикМакетаКомпоновкиДанных;
//		//Макет = КомпоновщикМакетаОСКД.Выполнить(ОСКД, КомпоновщикНастроекДанных.ПолучитьНастройкиОСКД());
//		Макет = КомпоновщикМакетаОСКД.Выполнить(ОСКД, НастройкиОСКД);
//		
//		ПроцессорКомпоновкиОСКД = Новый ПроцессорКомпоновкиДанных;
//		ПроцессорКомпоновкиОСКД.Инициализировать(Макет);
//		
//		//ТаблДок.Очистить();
//	
//		ПроцессорВыводаОСКД = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
//		ПроцессорВыводаОСКД.УстановитьДокумент(ТаблДокум);
//		ПроцессорВыводаОСКД.Вывести(ПроцессорКомпоновкиОСКД);
//		
//		КоличествоУровней = Результат.КоличествоУровнейГруппировокСтрок();
//		Для Уровень = 1 По КоличествоУровней - 1 Цикл
//			ТаблДокум.ПоказатьУровеньГруппировокСтрок(КоличествоУровней - Уровень);
//		КонецЦикла;
//		
//		Результат=ТаблДокум;

//	  //  ИмяОрганизации=СтрЗаменить(Выборка.НаименованиеСокращенное,"""","");
//	  //  
//	  //  
//	  //
//	  //  ПараметрыЗнач=Новый Структура ;

//	  //  ПараметрыЗнач.Вставить("Организация",ИмяОрганизации);
//	  //  ПараметрыЗнач.Вставить("ТаблДокум",ТаблДокум);
//	  //  
//	  //  МассивЗнач.Добавить(ПараметрыЗнач);

//		
//	КонецЦикла; 
//	
//	Возврат МассивЗнач;
//	
//	//АдресХранилища=ПоместитьВоВременноеХранилище(ТаблЗначений,Новый УникальныйИдентификатор);
//	
//КонецФункции


//&НаКлиенте
//Процедура ПослеФормированияОтчета()
//	
//	Если НРег(СокрЛП(ПользователиКлиент.ТекущийПользователь()))=НРег("Robot") Тогда
//		ЗавершитьРаботуСистемы(Ложь);
//	КонецЕсли; 
//КонецПроцедуры

